#include"MknclrArr.h"

template<typename T>T** allocate(const unsigned int rows, const unsigned int cols)
{
	///////////////////////////////////////////////////////////////////////////////
	////////////		Объявление двумерного динамического массива		///////////
	///////////////////////////////////////////////////////////////////////////////
	T** arr = new T * [rows];	//Создаем массив указателей
	for (int i = 0; i < rows; i++)
	{
		arr[i] = new T[cols]{};	//Выделяем память под строки двумерного массива
		//и помещаем адреса строк в элементы массива указателей.
	}
	return arr;
}
template<typename T>void clear(T** arr, const unsigned int rows)
{
	///////////////////////////////////////////////////////////////////////////////
	////////////		Удаление двумерного динамического массива		///////////
	///////////////////////////////////////////////////////////////////////////////
	//1) Удаляем строки двумерного массива:
	for (int i = 0; i < rows; i++)
	{
		delete[] arr[i];
	}
	//2) Удаляем массив указателей:
	delete[] arr;
}